app/controllers/all_restaurants_controller.rb

  def index
    @all_restaurants = AllRestaurant.all
---
SELECT "all_restaurants".* FROM "all_restaurants"