app/controllers/collections_controller.rb

SELECT "collections".* FROM "collections" WHERE "collections"."user_id" = $1  [["user_id", 3]]
---
  def find_collection
    @collection = current_user.collections.find_by(id: params[:id])